#include <stdio.h>

int main()
{
    printf("Hello, world\n"); // выводим строку как есть
    printf("The answer is: %d!\n", 42); // выводим строку The answer is: 42! и перевод строки
    printf("One says: %d%% of 100 is %d\n", 6, 13); // вывод: One says: 6% of 100 is 13
    printf("%x", 256); // вывод: 100
    printf("%08x", 512); // вывод: 00000200
    printf("%llu", -1LL); // вывод: 18446744073709551615
    printf("%f", 3.1415926535897932384626433832795028841971); // вывод: 3.141593
    printf("%.10g\n", 3.141592653589793238 * 100000000000.0); // вывод: 3.141592654e+11

    // в цикле считываем последовательность целых чисел разделенных пробельными символами до признака конца файла
    int a;
    while (scanf("%d", &a) == 1) {
    }

    // в цикле считываем последовательность пар целых чисел до признака конца файла
    int a, b;
    while (scanf("%d%d", &a, &b) == 2) {
    }

    // считываем long long
    long long x;
    int r = scanf("%lld", &x);

    // считываем double
    double d;
    int r = scanf("%lf", &d);
    // обратите внимание, что double выводится в printf с помощью %f, а считывается с помощью %lf

    // считываем пару шестнадцатеричных чисел, разделенных минусом, например, 100-1ff
    unsigned l, h;
    int r = scanf("%x-%x", &l, &h); // для примера выше получим результат l == 0x100, h == 0x1ff
}